andersenthomas98/masteroppgave/nrf5sdk_thread/examples/peripheral/radio_test/radio_cmd.c
#ifdef NRF52840_XXAA
    uint32_t dcdcen = NRF_POWER->DCDCEN;

    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "DCDC REG0 state %lu\r\n",
                    "DCDC REG1 state %lu\r\n",
                     "Write '0' to toggle state of DCDC REG0\r\n",
                     "Write '1' to toggle state of DCDC REG1",
                    NRF_POWER->DCDCEN0,
                    dcdcen);
#else
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "DCDC state %lu\r\n",
                    "Write '1' to enable, '0' to disable\r\n",
                    NRF_POWER->DCDCEN);
#endif
}


static void cmd_print_payload(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    radio_print_rx(p_cli, m_mode);
}


NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_data_rate)
{
    NRF_CLI_CMD(nrf_1Mbit, NULL, "1 Mbit/s Nordic proprietary radio mode", cmd_nrf_1mbit),
    NRF_CLI_CMD(nrf_2Mbit, NULL, "2 Mbit/s Nordic proprietary radio mode", cmd_nrf_2mbit),
    #ifdef NRF52832_XXAA
    NRF_CLI_CMD(nrf_250Kbit, NULL, "250 kbit/s Nordic proprietary radio mode", cmd_nrf_250kbit),
    #endif // NRF52832_XXAA
    NRF_CLI_CMD(ble_1Mbit, NULL, "1 Mbit/s Bluetooth Low Energy", cmd_ble_1mbit),
    NRF_CLI_CMD(ble_2Mbit, NULL, "2 Mbit/s Bluetooth Low Energy", cmd_ble_2mbit),

#if defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
    NRF_CLI_CMD(ble_lr250Kbit,
                NULL,
                "Long range 125 kbit/s TX, 125 kbit/s and 500 kbit/s RX",
                cmd_ble_lr125kbit),
    NRF_CLI_CMD(ble_lr500Kbit,
                NULL,
                "Long range 500 kbit/s TX, 125 kbit/s and 500 kbit/s RX",
                cmd_ble_lr500kbit),
    NRF_CLI_CMD(ieee802154_250Kbit, NULL, "IEEE 802.15.4-2006 250 kbit/s", cmd_ble_ieee),
    #endif // defined(NRF52840_XXAA) || defined(NRF52833_XXAA)

    NRF_CLI_SUBCMD_SET_END
};


NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_output_power)
{
#if defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
    NRF_CLI_CMD(pos8dBm, NULL, "TX power: +8 dBm", cmd_pos8dbm),
    NRF_CLI_CMD(pos7dBm, NULL, "TX power: +7 dBm", cmd_pos7dbm),
    NRF_CLI_CMD(pos6dBm, NULL, "TX power: +6 dBm", cmd_pos6dbm),
    NRF_CLI_CMD(pos5dBm, NULL, "TX power: +5 dBm", cmd_pos5dbm),
    NRF_CLI_CMD(pos2dBm, NULL, "TX power: +2 dBm", cmd_pos2dbm),
#endif // defined(NRF52840_XXAA) || defined(NRF52833_XXAA)
    NRF_CLI_CMD(pos3dBm, NULL, "TX power: +3 dBm", cmd_pos3dbm),
    NRF_CLI_CMD(pos4dBm, NULL, "TX power: +4 dBm", cmd_pos4dbm),
    NRF_CLI_CMD(pos0dBm, NULL, "TX power: 0 dBm", cmd_pos0dbm),
    NRF_CLI_CMD(neg4dBm, NULL, "TX power: -4 dBm", cmd_neg4dbm),
    NRF_CLI_CMD(neg8dBm, NULL, "TX power: -8 dBm", cmd_neg8dbm),
    NRF_CLI_CMD(neg12dBm, NULL, "TX power: -12 dBm", cmd_neg12dbm),
    NRF_CLI_CMD(neg16dBm, NULL, "TX power: -16 dBm", cmd_neg16dbm),
    NRF_CLI_CMD(neg20dBm, NULL, "TX power: -20 dBm", cmd_neg20dbm),
    NRF_CLI_CMD(neg30dBm, NULL, "TX power: -30 dBm", cmd_neg30dbm),
    NRF_CLI_CMD(neg40dBm, NULL, "TX power: -40 dBm", cmd_neg40dbm),
    NRF_CLI_SUBCMD_SET_END
};


NRF_CLI_CREATE_STATIC_SUBCMD_SET(m_sub_transmit_pattern)
{
    NRF_CLI_CMD(pattern_random, NULL, "Set the transmission pattern to random.", cmd_pattern_random),
    NRF_CLI_CMD(pattern_11110000, NULL, "Set the transmission pattern to 11110000.", cmd_pattern_11110000),
    NRF_CLI_CMD(pattern_11001100, NULL, "Set the transmission pattern to 10101010.", cmd_pattern_11001100),
    NRF_CLI_SUBCMD_SET_END
};


NRF_CLI_CMD_REGISTER(start_channel,
                     NULL,
                     "Start the channel for the sweep or the channel for the constant carrier <channel>",
                     cmd_start_channel_set);
NRF_CLI_CMD_REGISTER(end_channel, NULL, "End the channel for the sweep <channel>", cmd_end_channel_set);
NRF_CLI_CMD_REGISTER(time_on_channel,
                     NULL,
                     "Time on each channel (between 1 ms and 99 ms) <time>",
                     cmd_time_set);
NRF_CLI_CMD_REGISTER(cancel, NULL, "Cancel the sweep or the carrier", cmd_cancel);
NRF_CLI_CMD_REGISTER(data_rate, &m_sub_data_rate, "Set data rate <sub_cmd>", cmd_data_rate_set);
NRF_CLI_CMD_REGISTER(start_tx_carrier, NULL, "Start the TX carrier", cmd_tx_carrier_start);
NRF_CLI_CMD_REGISTER(start_tx_modulated_carrier,
                     NULL,
                     "Start the modulated TX carrier",
                     cmd_tx_modulated_carrier_start);
NRF_CLI_CMD_REGISTER(output_power,
                     &m_sub_output_power,
                     "Output power set <sub_cmd>",
                     cmd_output_power_set);
NRF_CLI_CMD_REGISTER(transmit_pattern,
                     &m_sub_transmit_pattern,
                     "Set the transmission pattern",
                     cmd_transmit_pattern_set);
NRF_CLI_CMD_REGISTER(start_duty_cycle_modulated_tx,
                     NULL,
                     "Duty cycle in percent (two decimal digits, between 01 and 99) <duty_cycle>",
                     cmd_duty_cycle_set);
NRF_CLI_CMD_REGISTER(parameters_print, NULL, "Print current delay, channel and so on", cmd_print);
NRF_CLI_CMD_REGISTER(start_rx_sweep, NULL, "Start RX sweep", cmd_rx_sweep_start);
NRF_CLI_CMD_REGISTER(start_tx_sweep, NULL, "Start TX sweep", cmd_tx_sweep_start);
NRF_CLI_CMD_REGISTER(start_rx, NULL, "Start RX", cmd_rx_start);
NRF_CLI_CMD_REGISTER(toggle_dcdc_state, NULL, TOGGLE_DCDC_HELP, cmd_toggle_dc);
NRF_CLI_CMD_REGISTER(print_rx, NULL, "Print received payload", cmd_print_payload);
